In [1]:
#1
import pandas as pd

In [10]:
data = {"A":[1,2,3,4],
       "B":[4,5,6,7],
       "C":["sudh" , "krish","hitesh","navin"]}

In [11]:
df=pd.DataFrame(data)

In [4]:
l=[1,2,3,4,5]

In [5]:
a=pd.Series(data=l)

In [6]:
pd.set_option("display.max_colwidth" , 1000)
df3 = pd.DataFrame({"desc": ["Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.","my name is sudh" , "i use to take data science mastes class"]})

In [7]:
data1 = pd.date_range(start = '2022-03-22' ,end = '2022-06-22')

In [8]:
dt = pd.to_datetime('2022-06-20')

In [9]:
#2

In [12]:
df

   A  B       C
0  1  4    sudh
1  2  5   krish
2  3  6  hitesh
3  4  7   navin

In [20]:
 
df.reindex([1,3,5,7])

     A    B      C
1  2.0  5.0  krish
3  4.0  7.0  navin
5  NaN  NaN    NaN
7  NaN  NaN    NaN

In [21]:
#3
data3={'Value':[10, 20, 30, 40, 50]}

In [22]:
df4=pd.DataFrame(data3)

In [23]:
df4

   Value
0     10
1     20
2     30
3     40
4     50

In [35]:
s=df4['Value'][0:3].sum()

In [36]:
s

60

In [37]:
#4

In [43]:
data5={'Text':["sudh is" , "krish is is","hitesh is na sdn","navin"]}

In [44]:
df5=pd.DataFrame(data5)

In [45]:
df5

               Text
0           sudh is
1       krish is is
2  hitesh is na sdn
3             navin

In [47]:
df5['Word_Count']=df5['Text'].apply(lambda x:len(x.split()))

In [48]:
df5

               Text  Word_Count
0           sudh is           2
1       krish is is           3
2  hitesh is na sdn           4
3             navin           1

In [50]:
#5 Gives the total number of elements
df5.size

8

In [52]:
#Gives the number of rows and columns
df5.shape

(4, 2)

In [53]:
#6 We use read_excel function

In [56]:
# df6=pd.read_excel('work/Copy of LUSID Excel - Setting up your market data.xlsx')

In [57]:
#7

In [59]:
df7=pd.DataFrame({'Email':['username1@domain.com','username2@domain.com','username3@domain.com']})

In [60]:
df7

                  Email
0  username1@domain.com
1  username2@domain.com
2  username3@domain.com

In [67]:
df7['Username']=df7['Email'].apply(lambda x: x[0:x.find('@')])

In [68]:
df7

                  Email   Username
0  username1@domain.com  username1
1  username2@domain.com  username2
2  username3@domain.com  username3

In [69]:
#8

In [83]:
df8=pd.DataFrame({'A':[3,8,6,3,9],'B':[5,2,9,3,1],'C':[1,7,4,5,2]})

In [84]:
df8

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  3  3  5
4  9  1  2

In [89]:
df9=df8[(df8['A']>5) & (df8['B']<10)]

In [90]:
df9

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [91]:
type(df9)

pandas.core.frame.DataFrame